HardenedBSD/hardenedBSD-stable/share/man/man5/src.conf.5
.\" DO NOT EDIT-- this file is automatically generated.
.\" from FreeBSD$
.\" $FreeBSD$
.Dd August 22, 2016
.Dt SRC.CONF 5
.Os
.Sh NAME
.Nm src.conf
.Nd "source build options"
.Sh DESCRIPTION
The
.Nm
file contains settings that will apply to every build involving the
.Fx
source tree; see
.Xr build 7 .
.Pp
The
.Nm
file uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the aspects of how the system builds.
.Pp
The default location of
.Nm
is
.Pa /etc/src.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va SRCCONF .
Overriding the location of
.Nm
may be necessary if the system-wide settings are not suitable
for a particular build.
For instance, setting
.Va SRCCONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The only purpose of
.Nm
is to control the compilation of the
.Fx
source code, which is usually located in
.Pa /usr/src .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in its environment; see
.Xr environ 7 .
.Pp
The environment of
.Xr make 1
for the build can be controlled via the
.Va SRC_ENV_CONF
variable, which defaults to
.Pa /etc/src-env.conf .
Some examples that may only be set in this file are
.Va WITH_DIRDEPS_BUILD ,
and
.Va WITH_META_MODE
as they are environment-only variables.
Note that
.Va MAKEOBJDIRPREFIX
may be set here only when using
.Va WITH_DIRDEPS_BUILD .
.Pp
The values of variables are ignored regardless of their setting;
even if they would be set to
.Dq Li FALSE
or
.Dq Li NO .
Just the existence of an option will cause
it to be honoured by
.Xr make 1 .
.Pp
The following list provides a name and short description for variables
that can be used for source builds.
.Bl -tag -width indent
.It Va WITHOUT_ACCT
.\" $FreeBSD$
Set to not build process accounting tools such as
.Xr accton 8
and
.Xr sa 8 .
.It Va WITHOUT_ACPI
.\" $FreeBSD$
Set to not build
.Xr acpiconf 8 ,
.Xr acpidump 8
and related programs.
.It Va WITHOUT_AMD
.\" $FreeBSD$
Set to not build
.Xr amd 8 ,
and related programs.
.It Va WITHOUT_APM
.\" $FreeBSD$
Set to not build
.Xr apm 8 ,
.Xr apmd 8
and related programs.
.It Va WITHOUT_ASSERT_DEBUG
.\" $FreeBSD$
Set to compile programs and libraries without the
.Xr assert 3
checks.
.It Va WITHOUT_AT
.\" $FreeBSD$
Set to not build
.Xr at 1
and related utilities.
.It Va WITHOUT_ATM
.\" $FreeBSD$
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" $FreeBSD$
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" $FreeBSD$
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_AUTOFS
.\" $FreeBSD$
Set to not build
.Xr autofs 5
related programs, libraries, and kernel modules.
.It Va WITH_AUTO_OBJ
.\" $FreeBSD$
Enable automatic creation of objdirs.
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_BHYVE
.\" $FreeBSD$
Set to not build or install
.Xr bhyve 8 ,
associated utilities, and examples.
.Pp
This option only affects amd64/amd64.
.It Va WITHOUT_BINUTILS
.\" $FreeBSD$
Set to not build or install binutils (as, ld, objcopy, and objdump ) as part
of the normal system build.
The resulting system cannot build programs from source.
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_BINUTILS
.\" $FreeBSD$
Set to build and install binutils (as, ld, objcopy, and objdump) as part
of the normal system build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_BINUTILS_BOOTSTRAP
.\" $FreeBSD$
Set to not build binutils (as, ld, objcopy and objdump)
as part of the bootstrap process.
.Bf -symbolic
The option does not work for build targets unless some alternative
toolchain is provided.
.Ef
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_BINUTILS_BOOTSTRAP
.\" $FreeBSD$
Set build binutils (as, ld, objcopy and objdump)
as part of the bootstrap process.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_BLACKLIST
.\" $FreeBSD$
Set this if you do not want to build blacklistd / blacklistctl.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BLACKLIST_SUPPORT
.El
.It Va WITHOUT_BLACKLIST_SUPPORT
.\" $FreeBSD$
Set to build some programs without blacklistd support, like
.Xr fingerd 8 ,
.Xr ftpd 8 ,
.Xr rlogind 8 ,
.Xr rshd 8 ,
and
.Xr sshd 8 .
.It Va WITHOUT_BLUETOOTH
.\" $FreeBSD$
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BOOT
.\" $FreeBSD$
Set to not build the boot blocks and loader.
.It Va WITHOUT_BOOTPARAMD
.\" $FreeBSD$
Set to not build or install
.Xr bootparamd 8 .
.It Va WITHOUT_BOOTPD
.\" $FreeBSD$
Set to not build or install
.Xr bootpd 8 .
.It Va WITHOUT_BSDINSTALL
.\" $FreeBSD$
Set to not build
.Xr bsdinstall 8 ,
.Xr sade 8 ,
and related programs.
.It Va WITHOUT_BSD_CPIO
.\" $FreeBSD$
Set to not build the BSD licensed version of cpio based on
.Xr libarchive 3 .
.It Va WITH_BSD_GREP
.\" $FreeBSD$
Install BSD-licensed grep as '[ef]grep' instead of GNU grep.
.It Va WITHOUT_BSNMP
.\" $FreeBSD$
Set to not build or install
.Xr bsnmpd 1
and related libraries and data files.
.It Va WITHOUT_BZIP2
.\" $FreeBSD$
Set to not build contributed bzip2 software as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BZIP2_SUPPORT
.El
.It Va WITHOUT_BZIP2_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional bzip2 support.
.It Va WITHOUT_CALENDAR
.\" $FreeBSD$
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CAPSICUM
.\" $FreeBSD$
Set to not build Capsicum support into system programs.
.It Va WITHOUT_CASPER
.\" $FreeBSD$
Set to not build Casper program and related libraries.
.It Va WITH_CCACHE_BUILD
.\" $FreeBSD$
Set to use
.Xr ccache 1
for the build.
No configuration is required except to install the
.Sy devel/ccache
package.
Using with
.Xr distcc 1
should set
.Sy CCACHE_PREFIX=/usr/local/bin/distcc .
The default cache directory of
.Pa $HOME/.ccache
will be used, which can be overridden by setting
.Sy CCACHE_DIR .
The
.Sy CCACHE_COMPILERCHECK
option defaults to
.Sy content
when using the in-tree bootstrap compiler,
and
.Sy mtime
when using an external compiler.
The
.Sy CCACHE_CPP2
option is used for Clang but not GCC.
.Pp
Sharing a cache between multiple work directories requires using a layout
similar to
.Pa /some/prefix/src
.Pa /some/prefix/obj
and an environment such as:
.Bd -literal -offset indent
CCACHE_BASEDIR='${SRCTOP:H}' MAKEOBJDIRPREFIX='${SRCTOP:H}/obj'
.Ed
.Pp
See
.Xr ccache 1
for more configuration options.
.It Va WITHOUT_CCD
.\" $FreeBSD$
Set to not build
.Xr geom_ccd 4
and related utilities.
.It Va WITHOUT_CDDL
.\" $FreeBSD$
Set to not build code licensed under Sun's CDDL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CTF
.It
.Va WITHOUT_ZFS
.El
.It Va WITHOUT_CLANG
.\" $FreeBSD$
Set to not build the Clang C/C++ compiler during the regular phase of the build.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.El
.It Va WITH_CLANG
.\" $FreeBSD$
Set to build the Clang C/C++ compiler during the normal phase of the build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_CLANG_BOOTSTRAP
.\" $FreeBSD$
Set to not build the Clang C/C++ compiler during the bootstrap phase of the build.
You must enable either gcc or clang bootstrap to be able to build the system,
unless an alternative compiler is provided via
XCC.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_CLANG_BOOTSTRAP
.\" $FreeBSD$
Set to build the Clang C/C++ compiler during the bootstrap phase of the build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_CLANG_EXTRAS
.\" $FreeBSD$
Set to build additional clang and llvm tools, such as bugpoint.
.It Va WITHOUT_CLANG_FULL
.\" $FreeBSD$
Set to avoid building the ARCMigrate, Rewriter and StaticAnalyzer components of
the Clang C/C++ compiler.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
.It Va WITH_CLANG_FULL
.\" $FreeBSD$
Set to build the ARCMigrate, Rewriter and StaticAnalyzer components of the
Clang C/C++ compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_CLANG_IS_CC
.\" $FreeBSD$
Set to install the GCC compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_CLANG_IS_CC
.\" $FreeBSD$
Set to install the Clang C/C++ compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITHOUT_CPP
.\" $FreeBSD$
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CROSS_COMPILER
.\" $FreeBSD$
Set to not build any cross compiler in the cross-tools stage of buildworld.
If you are compiling a different version of
.Fx
than what is installed on the system, you will need to provide an alternate
compiler with XCC to ensure success.
If you are compiling with an identical version of
.Fx
to the host, this option may be safely used.
This option may also be safe when the host version of
.Fx
is close to the sources being built, but all bets are off if there have
been any changes to the toolchain between the versions.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BINUTILS_BOOTSTRAP
.It
.Va WITHOUT_CLANG_BOOTSTRAP
.It
.Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
.It
.Va WITHOUT_GCC_BOOTSTRAP
.El
.It Va WITHOUT_CRYPT
.\" $FreeBSD$
Set to not build any crypto code.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITH_CTF
.\" $FreeBSD$
Set to compile with CTF (Compact C Type Format) data.
CTF data encapsulates a reduced form of debugging information
similar to DWARF and the venerable stabs and is required for DTrace.
.It Va WITHOUT_CTM
.\" $FreeBSD$
Set to not build
.Xr ctm 1
and related utilities.
.It Va WITHOUT_CUSE
.\" $FreeBSD$
Set to not build CUSE-related programs and libraries.
.It Va WITHOUT_CXX
.\" $FreeBSD$
Set to not build
.Xr c++ 1
and related libraries.
It will also prevent building of
.Xr gperf 1
and
.Xr devd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_DTRACE_TESTS
.It
.Va WITHOUT_GNUCXX
.It
.Va WITHOUT_GROFF
.It
.Va WITHOUT_TESTS
.It
.Va WITHOUT_TESTS_SUPPORT
.El
.It Va WITHOUT_DEBUG_FILES
.\" $FreeBSD$
Set to avoid building or installing standalone debug files for each
executable binary and shared library.
.It Va WITHOUT_DICT
.\" $FreeBSD$
Set to not build the Webster dictionary files.
.It Va WITH_DIRDEPS_BUILD
.\" $FreeBSD$
This is an experimental build system.
For details see
http://www.crufty.net/sjg/docs/freebsd-meta-mode.htm.
Build commands can be seen from the top-level with:
.Dl make show-valid-targets
The build is driven by dirdeps.mk using
.Va DIRDEPS
stored in
Makefile.depend files found in each directory.
.Pp
The build can be started from anywhere, and behaves the same.
The initial instance of
.Xr make 1 
recursively reads
.Va DIRDEPS
from Makefile.depend
computing a graph of tree dependencies from the current origin.
Setting
.Va NO_DIRDEPS
will skip checking dirdep dependencies and will only build in the current
and child directories.
.Va NO_DIRDEPS_BELOW
will skip building any dirdeps and only build the current directory.
.Pp
This also utilizes the
.Va WITH_META_MODE
logic for incremental builds.
.Pp
The build will hide commands ran unless
.Va NO_SILENT
is defined.
.Pp
Note that there is currently no mass install feature for this.
.Pp
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITH_INSTALL_AS_USER
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_SYSTEM_COMPILER
(unless
.Va WITH_SYSTEM_COMPILER
is set explicitly)
.It Va WITH_AUTO_OBJ
(unless
.Va WITHOUT_AUTO_OBJ
is set explicitly)
.It Va WITH_META_MODE
(unless
.Va WITHOUT_META_MODE
is set explicitly)
.It Va WITH_STAGING
(unless
.Va WITHOUT_STAGING
is set explicitly)
.It Va WITH_STAGING_MAN
(unless
.Va WITHOUT_STAGING_MAN
is set explicitly)
.It Va WITH_STAGING_PROG
(unless
.Va WITHOUT_STAGING_PROG
is set explicitly)
.It Va WITH_SYSROOT
(unless
.Va WITHOUT_SYSROOT
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_DIRDEPS_CACHE
.\" $FreeBSD$
Cache result of dirdeps.mk which can save significant time
for subsequent builds.
Depends on
.Va WITH_DIRDEPS_BUILD .
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_DMAGENT
.\" $FreeBSD$
Set to not build dma Mail Transport Agent
.It Va WITHOUT_DOCCOMPRESS
.\" $FreeBSD$
Set to not to install compressed system documentation.
Only the uncompressed version will be installed.
.It Va WITH_DTRACE_TESTS
.\" $FreeBSD$
Set to build and install the DTrace test suite in
.Pa /usr/tests/cddl/usr.sbin/dtrace .
This test suite is considered experimental on architectures other than
amd64/amd64 and running it may cause system instability.
.It Va WITHOUT_DYNAMICROOT
.\" $FreeBSD$
Set this if you do not want to link
.Pa /bin
and
.Pa /sbin
dynamically.
.It Va WITHOUT_ED_CRYPTO
.\" $FreeBSD$
Set to build
.Xr ed 1
without support for encryption/decryption.
.It Va WITHOUT_EE
.\" $FreeBSD$
Set to not build and install
.Xr edit 1 ,
.Xr ee 1 ,
and related programs.
.It Va WITH_EISA
.\" $FreeBSD$
Set to build EISA kernel modules.
.It Va WITHOUT_ELFCOPY_AS_OBJCOPY
.\" $FreeBSD$
Set to build and install
.Xr objcopy 1
from GNU Binutils, instead of the one from ELF Tool Chain.
This option is provided as a transition aid and will be removed in due time.
.It Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
.\" $FreeBSD$
Set to not build ELF Tool Chain tools
(addr2line, nm, size, strings and strip)
as part of the bootstrap process.
.Bf -symbolic
An alternate bootstrap tool chain must be provided.
.Ef
.It Va WITHOUT_EXAMPLES
.\" $FreeBSD$
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITH_EXTRA_TCP_STACKS
.\" $FreeBSD$
Set to build extra TCP stack modules.
.It Va WITHOUT_FDT
.\" $FreeBSD$
Set to not build Flattened Device Tree support as part of the base system.
This includes the device tree compiler (dtc) and libfdt support library.
.It Va WITHOUT_FILE
.\" $FreeBSD$
Set to not build
.Xr file 1
and related programs.
.It Va WITHOUT_FINGER
.\" $FreeBSD$
Set to not build or install
.Xr finger 1
and
.Xr fingerd 8 .
.It Va WITHOUT_FLOPPY
.\" $FreeBSD$
Set to not build or install programs
for operating floppy disk driver.
.It Va WITHOUT_FMTREE
.\" $FreeBSD$
Set to not build and install
.Pa /usr/sbin/fmtree .
.It Va WITHOUT_FORMAT_EXTENSIONS
.\" $FreeBSD$
Set to not enable
.Fl fformat-extensions
when compiling the kernel.
Also disables all format checking.
.It Va WITHOUT_FORTH
.\" $FreeBSD$
Set to build bootloaders without Forth support.
.It Va WITHOUT_FP_LIBC
.\" $FreeBSD$
Set to build
.Nm libc
without floating-point support.
.It Va WITH_FREEBSD_UPDATE
.\" $FreeBSD$
Set to build
.Xr freebsd-update 8 .
.It Va WITHOUT_FTP
.\" $FreeBSD$
Set to not build or install
.Xr ftp 1
and
.Xr ftpd 8 .
.It Va WITHOUT_GAMES
.\" $FreeBSD$
Set to not build games.
.It Va WITHOUT_GCC
.\" $FreeBSD$
Set to not build and install gcc and g++ as part of the normal build process.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GCC
.\" $FreeBSD$
Set to build and install gcc and g++.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GCC_BOOTSTRAP
.\" $FreeBSD$
Set to not build gcc and g++ as part of the bootstrap process.
You must enable either gcc or clang bootstrap to be able to build the system,
unless an alternative compiler is provided via
XCC.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GCC_BOOTSTRAP
.\" $FreeBSD$
Set to build gcc and g++ as part of the bootstrap process.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GCOV
.\" $FreeBSD$
Set to not build the
.Xr gcov 1
tool.
.It Va WITHOUT_GDB
.\" $FreeBSD$
Set to not build
.Xr gdb 1 .
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_GDB
.\" $FreeBSD$
Set to build
.Xr gdb 1 .
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GNU
.\" $FreeBSD$
Set to not build contributed GNU software as a part of the base system.
This option can be useful if the system built must not contain any code
covered by the GNU Public License due to legal reasons.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GNU_SUPPORT
.El
.It Va WITHOUT_GNUCXX
.\" $FreeBSD$
Do not build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where clang is the system compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GNUCXX
.\" $FreeBSD$
Build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where gcc is the system compiler.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GNU_GREP_COMPAT
.\" $FreeBSD$
Set this option to omit the gnu extensions to grep from being included in
BSD grep.
.It Va WITHOUT_GNU_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIO
.\" $FreeBSD$
Set to not build
.Xr gpioctl 8
as part of the base system.
.It Va WITHOUT_GPL_DTC
.\" $FreeBSD$
Set to build the BSD licensed version of the device tree compiler, instead of the
GPL'd one from elinux.org.
.It Va WITHOUT_GROFF
.\" $FreeBSD$
Set to not build
.Xr groff 1
and
.Xr vgrind 1 .
You should consider installing the textproc/groff port to not break
.Xr man 1 .
.It Va WITHOUT_GSSAPI
.\" $FreeBSD$
Set to not build libgssapi.
.It Va WITHOUT_HAST
.\" $FreeBSD$
Set to not build
.Xr hastd 8
and related utilities.
.It Va WITHOUT_HBSD_UPDATE
.\" $HardenedBSD$
Set to not build
.Xr hbsd-update 8 
and
.Xr hbsd-update-build 8 .
.It Va WITH_HESIOD
.\" $FreeBSD$
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" $FreeBSD$
Set to not build HTML docs.
.It Va WITHOUT_HYPERV
.\" $FreeBSD$
Set to not build or install HyperV utilities.
.It Va WITHOUT_ICONV
.\" $FreeBSD$
Set to not build iconv as part of libc.
.It Va WITHOUT_INCLUDES
.\" $FreeBSD$
Set to not install header files.
This option used to be spelled
.Va NO_INCS .
.Bf -symbolic
The option does not work for build targets.
.Ef
.It Va WITHOUT_INET
.\" $FreeBSD$
Set to not build programs and libraries related to IPv4 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET_SUPPORT
.El
.It Va WITHOUT_INET6
.\" $FreeBSD$
Set to not build
programs and libraries related to IPv6 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INETD
.\" $FreeBSD$
Set to not build
.Xr inetd 8 .
.It Va WITHOUT_INET_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without IPv4 support.
.It Va WITHOUT_INSTALLLIB
.\" $FreeBSD$
Set this if you do not want to install optional libraries.
For example when creating a
.Xr nanobsd 8
image.
.Bf -symbolic
The option does not work for build targets.
.Ef
.It Va WITH_INSTALL_AS_USER
.\" $FreeBSD$
Set to make install targets succeed for non-root users by installing
files with owner and group attributes set to that of the user running
the
.Xr make 1
command.
The user still has to set the
.Va DESTDIR
variable to point to a directory where the user has write permissions.
.It Va WITHOUT_IPFILTER
.\" $FreeBSD$
Set to not build IP Filter package.
.It Va WITHOUT_IPFW
.\" $FreeBSD$
Set to not build IPFW tools.
.It Va WITHOUT_ISCSI
.\" $FreeBSD$
Set to not build
.Xr iscid 8
and related utilities.
.It Va WITHOUT_JAIL
.\" $FreeBSD$
Set to not build tools for the support of jails; e.g.,
.Xr jail 8 .
.It Va WITHOUT_KDUMP
.\" $FreeBSD$
Set to not build
.Xr kdump 1
and
.Xr truss 1 .
.It Va WITHOUT_KERBEROS
.\" $FreeBSD$
Set this if you do not want to build Kerberos 5 (KTH Heimdal).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS_SUPPORT
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_KERBEROS_SUPPORT
.\" $FreeBSD$
Set to build some programs without Kerberos support, like
.Xr ssh 1 ,
.Xr telnet 1 ,
.Xr sshd 8 ,
and
.Xr telnetd 8 .
.It Va WITHOUT_KERNEL_SYMBOLS
.\" $FreeBSD$
Set to not install kernel symbol files.
.Bf -symbolic
This option is recommended for those people who have small root partitions.
.Ef
.It Va WITHOUT_KVM
.\" $FreeBSD$
Set to not build the
.Nm libkvm
library as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KVM_SUPPORT
.El
.It Va WITHOUT_KVM_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional
.Nm libkvm
support.
.It Va WITHOUT_LDNS
.\" $FreeBSD$
Setting this variable will prevent the LDNS library from being built.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_UNBOUND
.El
.It Va WITHOUT_LDNS_UTILS
.\" $FreeBSD$
Setting this variable will prevent building the LDNS utilities
.Xr drill 1
and
.Xr host 1 .
.It Va WITHOUT_LEGACY_CONSOLE
.\" $FreeBSD$
Set to not build programs that support a legacy PC console; e.g.,
.Xr kbdcontrol 1
and
.Xr vidcontrol 1 .
.It Va WITH_LIB32
.\" $FreeBSD$
On 64-bit platforms, set to build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBCPLUSPLUS
.\" $FreeBSD$
Set to avoid building libcxxrt and libc++.
.It Va WITHOUT_LIBPTHREAD
.\" $FreeBSD$
Set to not build the
.Nm libpthread
providing library,
.Nm libthr .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LIBTHR
.El
.It Va WITHOUT_LIBRESSL
.\" $FreeBSD: $
Set to build OpenSSL as libcrypto/libssl provider as replacement of the LibreSSL equivalents. 
.It Va WITH_LIBSOFT
.\" $FreeBSD$
On armv6 only, set to enable soft float ABI compatibility libraries.
This option is for transitioning to the new hard float ABI.
.It Va WITHOUT_LIBTHR
.\" $FreeBSD$
Set to not build the
.Nm libthr
(1:1 threading)
library.
.It Va WITHOUT_LLDB
.\" $FreeBSD$
Set to not build the LLDB debugger.
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_LLDB
.\" $FreeBSD$
Set to build the LLDB debugger.
.Pp
It is a default setting on
amd64/amd64 and arm64/aarch64.
.It Va WITHOUT_LLVM_LIBUNWIND
.\" $FreeBSD$
Set to use GCC's stack unwinder (instead of LLVM's libunwind).
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_LLVM_LIBUNWIND
.\" $FreeBSD$
Set to use LLVM's libunwind stack unwinder (instead of GCC's unwinder).
.Pp
It is a default setting on
amd64/amd64, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITHOUT_LOCALES
.\" $FreeBSD$
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LOCATE
.\" $FreeBSD$
Set to not build
.Xr locate 1
and related programs.
.It Va WITHOUT_LPR
.\" $FreeBSD$
Set to not build
.Xr lpr 1
and related programs.
.It Va WITHOUT_LS_COLORS
.\" $FreeBSD$
Set to build
.Xr ls 1
without support for colors to distinguish file types.
.It Va WITHOUT_LZMA_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional lzma compression support.
.It Va WITHOUT_MAIL
.\" $FreeBSD$
Set to not build any mail support (MUA or MTA).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DMAGENT
.It
.Va WITHOUT_MAILWRAPPER
.It
.Va WITHOUT_SENDMAIL
.El
.It Va WITHOUT_MAILWRAPPER
.\" $FreeBSD$
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va WITHOUT_MAKE
.\" $FreeBSD$
Set to not install
.Xr make 1
and related support files.
.It Va WITHOUT_MAN
.\" $FreeBSD$
Set to not build manual pages.
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_MAN_UTILS
(unless
.Va WITH_MAN_UTILS
is set explicitly)
.El
.It Va WITHOUT_MANCOMPRESS
.\" $FreeBSD$
Set to not to install compressed man pages.
Only the uncompressed versions will be installed.
.It Va WITHOUT_MANDOCDB
.\" $FreeBSD$
Use the
.Xr mandoc 1
version of
.Xr makewhatis 8
database and utilities.
.It Va WITHOUT_MAN_UTILS
.\" $FreeBSD$
Set to not build utilities for manual pages,
.Xr apropos 1 ,
.Xr catman 1 ,
.Xr makewhatis 1 ,
.Xr man 1 ,
.Xr whatis 1 ,
.Xr manctl 8 ,
and related support files.
.It Va WITH_META_MODE
.\" $FreeBSD$
Creates
.Xr make 1
meta files when building, which can provide a reliable incremental build when
using
.Xr filemon 4 .
The meta file is created in the OBJDIR as
.Pa target.meta .
These meta files track the command ran, its output, and the current directory.
The
.Xr filemon 4
module is required unless
.Va NO_FILEMON
is defined.
When the module is loaded, any files used by the commands executed will be
tracked as
dependencies for the target in its meta file.
The target will be considered out-of-date and rebuilt if any of the following
are true compared to the last build:
.Bl -bullet -compact
.It
The command to execute changes.
.It
The current working directory changes.
.It
The target's meta file is missing.
.It
The target's meta file is missing filemon data when filemon is loaded
and a previous run did not have it loaded.
.It
[requires
.Xr filemon 4 ]
Files read, executed or linked to are newer than the target.
.It
[requires
.Xr filemon 4 ]
Files read, written, executed or linked are missing.
.El
The meta files can also be useful for debugging.
.Pp
The build will hide commands ran unless
.Va NO_SILENT
is defined.
Errors will cause
.Xr make 1
to show some of its environment for further debugging.
.Pp
The build operates as it normally would otherwise.
This option originally invoked a different build system but that was renamed
to
.Va WITH_DIRDEPS_BUILD .
.Pp
Currently this also enforces
.Va WITHOUT_SYSTEM_COMPILER .
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_SYSTEM_COMPILER
(unless
.Va WITH_SYSTEM_COMPILER
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_NAND
.\" $FreeBSD$
Set to build the NAND Flash components.
.It Va WITHOUT_NDIS
.\" $FreeBSD$
Set to not build programs and libraries
related to NDIS emulation support.
.It Va WITHOUT_NETCAT
.\" $FreeBSD$
Set to not build
.Xr nc 1
utility.
.It Va WITHOUT_NETGRAPH
.\" $FreeBSD$
Set to not build applications to support
.Xr netgraph 4 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_ATM
.It
.Va WITHOUT_BLUETOOTH
.It
.Va WITHOUT_NETGRAPH_SUPPORT
.El
.It Va WITHOUT_NETGRAPH_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without netgraph support.
.It Va WITHOUT_NIS
.\" $FreeBSD$
Set to not build
.Xr NIS 8
support and related programs.
If set, you might need to adopt your
.Xr nsswitch.conf 5
and remove
.Sq nis
entries.
.It Va WITHOUT_NLS
.\" $FreeBSD$
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" $FreeBSD$
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_NS_CACHING
.\" $FreeBSD$
Set to disable name caching in the
.Pa nsswitch
subsystem.
The generic caching daemon,
.Xr nscd 8 ,
will not be built either if this option is set.
.It Va WITHOUT_NTP
.\" $FreeBSD$
Set to not build
.Xr ntpd 8
and related programs.
.It Va WITH_OFED
.\" $FreeBSD$
Set to build the
.Dq "OpenFabrics Enterprise Distribution"
Infiniband software stack.
.It Va WITH_OPENLDAP
.\" $FreeBSD$
Enable building openldap support for kerberos.
.It Va WITHOUT_OPENSSH
.\" $FreeBSD$
Set to not build OpenSSH.
.It Va WITHOUT_OPENSSL
.\" $FreeBSD$
Set to not build OpenSSL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_PAM
.\" $FreeBSD$
Set to not build PAM library and modules.
.Bf -symbolic
This option is deprecated and does nothing.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_PAM_SUPPORT
.El
.It Va WITHOUT_PAM_SUPPORT
.\" $FreeBSD$
Set to build some programs without PAM support, particularly
.Xr ftpd 8
and
.Xr ppp 8 .
.It Va WITHOUT_PC_SYSINSTALL
.\" $FreeBSD$
Set to not build
.Xr pc-sysinstall 8
and related programs.
.It Va WITHOUT_PF
.\" $FreeBSD$
Set to not build PF firewall package.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PIE
Disable building of Position-Independent Executables (PIEs).
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_PKGBOOTSTRAP
.\" $FreeBSD$
Set to not build
.Xr pkg 7
bootstrap tool.
.It Va WITHOUT_PMC
.\" $FreeBSD$
Set to not build
.Xr pmccontrol 8
and related programs.
.It Va WITH_PORTSNAP
.\" $FreeBSD$
Set to build or install
.Xr portsnap 8
and related files.
.It Va WITHOUT_PPP
.\" $FreeBSD$
Set to not build
.Xr ppp 8
and related programs.
.It Va WITHOUT_PROFILE
.\" $FreeBSD$
Set to avoid compiling profiled libraries.
.It Va WITHOUT_QUOTAS
.\" $FreeBSD$
Set to not build
.Xr quota 1
and related programs.
.It Va WITHOUT_RADIUS_SUPPORT
.\" $FreeBSD$
Set to not build radius support into various applications, like
.Xr pam_radius 8
and
.Xr ppp 8 .
.It Va WITHOUT_RBOOTD
.\" $FreeBSD$
Set to not build or install
.Xr rbootd 8 .
.It Va WITHOUT_RCMDS
.\" $FreeBSD$
Disable building of the
.Bx
r-commands.
This includes
.Xr rlogin 1 ,
.Xr rsh 1 ,
etc.
.It Va WITHOUT_RCS
.\" $FreeBSD$
Set to not build
.Xr rcs 1 ,
.Xr etcupdate 8 ,
and related utilities.
.It Va WITHOUT_RESCUE
.\" $FreeBSD$
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_ROUTED
.\" $FreeBSD$
Set to not build
.Xr routed 8
utility.
.It Va WITHOUT_SENDMAIL
.\" $FreeBSD$
Set to not build
.Xr sendmail 8
and related programs.
.It Va WITHOUT_SETUID_LOGIN
.\" $FreeBSD$
Set this to disable the installation of
.Xr login 1
as a set-user-ID root program.
.It Va WITHOUT_SHAREDOCS
.\" $FreeBSD$
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITH_SORT_THREADS
.\" $FreeBSD$
Set to enable threads in
.Xr sort 1 .
.It Va WITHOUT_SOURCELESS
.\" $FreeBSD$
Set to not build kernel modules that include sourceless code (either microcode or native code for host CPU).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_SOURCELESS_HOST
.It
.Va WITHOUT_SOURCELESS_UCODE
.El
.It Va WITHOUT_SOURCELESS_HOST
.\" $FreeBSD$
Set to not build kernel modules that include sourceless native code for host CPU.
.It Va WITHOUT_SOURCELESS_UCODE
.\" $FreeBSD$
Set to not build kernel modules that include sourceless microcode.
.It Va WITHOUT_SSP
.\" $FreeBSD$
Set to not build world with propolice stack smashing protection.
.It Va WITH_STAGING
.\" $FreeBSD$
Enable staging of files to a stage tree.
This can be best thought of as auto-install to
.Va DESTDIR
with some extra meta data to ensure dependencies can be tracked.
Depends on
.Va WITH_DIRDEPS_BUILD .
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITH_STAGING_MAN
(unless
.Va WITHOUT_STAGING_MAN
is set explicitly)
.It Va WITH_STAGING_PROG
(unless
.Va WITHOUT_STAGING_PROG
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_STAGING_MAN
.\" $FreeBSD$
Enable staging of MAN pages to stage tree.
.It Va WITH_STAGING_PROG
.\" $FreeBSD$
Enable staging of PROGs to stage tree.
.It Va WITH_STALE_STAGED
.\" $FreeBSD$
Check staged files are not stale.
.It Va WITH_SVN
.\" $FreeBSD$
Set to install
.Xr svnlite 1
as
.Xr svn 1 .
.It Va WITHOUT_SVNLITE
.\" $FreeBSD$
Set to not build
.Xr svnlite 1
and related programs.
.It Va WITHOUT_SYMVER
.\" $FreeBSD$
Set to disable symbol versioning when building shared libraries.
.It Va WITHOUT_SYSCONS
.\" $FreeBSD$
Set to not build
.Xr syscons 4
support files such as keyboard maps, fonts, and screen output maps.
.It Va WITH_SYSROOT
.\" $FreeBSD$
Enable use of sysroot during build.
Depends on
.Va WITH_DIRDEPS_BUILD .
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_SYSTEM_COMPILER
.\" $FreeBSD$
Set to not opportunistically skip building a cross-compiler during the
bootstrap phase of the build.
Normally, if the currently installed compiler matches the planned bootstrap
compiler type and revision, then it will not be built.
This does not prevent a compiler from being built for installation though,
only for building one for the build itself.
The
.Va WITHOUT_CLANG
and
.Va WITHOUT_GCC
options control those.
.It Va WITHOUT_TALK
.\" $FreeBSD$
Set to not build or install
.Xr talk 1
and
.Xr talkd 8 .
.It Va WITHOUT_TCP_WRAPPERS
.\" $FreeBSD$
Set to not build or install
.Xr tcpd 8 ,
and related utilities.
.It Va WITHOUT_TCSH
.\" $FreeBSD$
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va WITHOUT_TELNET
.\" $FreeBSD$
Set to not build
.Xr telnet 1
and related programs.
.It Va WITHOUT_TESTS
.\" $FreeBSD$
Set to not build nor install the
.Fx
Test Suite in
.Pa /usr/tests/ .
See
.Xr tests 7
for more details.
This also disables the build of all test-related dependencies, including ATF.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DTRACE_TESTS
.It
.Va WITHOUT_TESTS_SUPPORT
.El
.It Va WITHOUT_TESTS_SUPPORT
.\" $FreeBSD$
Set to disables the build of all test-related dependencies, including ATF.
.It Va WITHOUT_TEXTPROC
.\" $FreeBSD$
Set to not build
programs used for text processing.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GROFF
.El
.It Va WITHOUT_TFTP
.\" $FreeBSD$
Set to not build or install
.Xr tftp 1
and
.Xr tftpd 8 .
.It Va WITHOUT_TIMED
.\" $FreeBSD$
Set to not build or install
.Xr timed 8 .
.It Va WITHOUT_TOOLCHAIN
.\" $FreeBSD$
Set to not install header or
programs used for program development,
compilers, debuggers etc.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BINUTILS
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_GCC
.It
.Va WITHOUT_GDB
.It
.Va WITHOUT_INCLUDES
.It
.Va WITHOUT_LLDB
.El
.It Va WITHOUT_UNBOUND
.\" $FreeBSD$
Set to not build
.Xr unbound 8
and related programs.
.It Va WITHOUT_USB
.\" $FreeBSD$
Set to not build USB-related programs and libraries.
.It Va WITHOUT_USB_GADGET_EXAMPLES
.\" $FreeBSD$
Set to build USB gadget kernel modules.
.It Va WITHOUT_UTMPX
.\" $FreeBSD$
Set to not build user accounting tools such as
.Xr last 1 ,
.Xr users 1 ,
.Xr who 1 ,
.Xr ac 8 ,
.Xr lastlogin 8
and
.Xr utx 8 .
.It Va WITHOUT_VI
.\" $FreeBSD$
Set to not build and install vi, view, ex and related programs.
.It Va WITHOUT_VT
.\" $FreeBSD$
Set to not build
.Xr vt 4
support files (fonts and keymaps).
.It Va WITHOUT_WARNS
.\" $FreeBSD$
Set this to not add warning flags to the compiler invocations.
Useful as a temporary workaround when code enters the tree
which triggers warnings in environments that differ from the
original developer.
.It Va WITHOUT_WIRELESS
.\" $FreeBSD$
Set to not build programs used for 802.11 wireless networks; especially
.Xr wpa_supplicant 8
and
.Xr hostapd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_WIRELESS_SUPPORT
.El
.It Va WITHOUT_WIRELESS_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without
802.11 wireless support.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" $FreeBSD$
Build
.Xr wpa_supplicant 8
without support for the IEEE 802.1X protocol and without
support for EAP-PEAP, EAP-TLS, EAP-LEAP, and EAP-TTLS
protocols (usable only via 802.1X).
.It Va WITHOUT_ZFS
.\" $FreeBSD$
Set to not build ZFS file system.
.It Va WITHOUT_ZONEINFO
.\" $FreeBSD$
Set to not build the timezone database.
.El
.Sh FILES
.Bl -tag -compact -width Pa
.It Pa /etc/src.conf
.It Pa /etc/src-env.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
file appeared in
.Fx 7.0 .
.Sh AUTHORS
This manual page was autogenerated.
