HardenedBSD/hardenedBSD-stable/share/man/man5/src.conf.5
.\" DO NOT EDIT-- this file is automatically generated.
<<<<<<< HEAD
.\" from FreeBSD$
.\" $FreeBSD$
.Dd June 29, 2016
=======
.\" from FreeBSD: stable/11/tools/build/options/makeman 292283 2015-12-15 18:42:30Z bdrewery
.\" $FreeBSD$
.Dd December 12, 2016
>>>>>>> origin/freebsd/11-stable/master
.Dt SRC.CONF 5
.Os
.Sh NAME
.Nm src.conf
.Nd "source build options"
.Sh DESCRIPTION
The
.Nm
file contains settings that will apply to every build involving the
.Fx
source tree; see
.Xr build 7 .
.Pp
The
.Nm
file uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the aspects of how the system builds.
.Pp
The default location of
.Nm
is
.Pa /etc/src.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va SRCCONF .
Overriding the location of
.Nm
may be necessary if the system-wide settings are not suitable
for a particular build.
For instance, setting
.Va SRCCONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The only purpose of
.Nm
is to control the compilation of the
.Fx
source code, which is usually located in
.Pa /usr/src .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in its environment; see
.Xr environ 7 .
.Pp
The environment of
.Xr make 1
for the build can be controlled via the
.Va SRC_ENV_CONF
variable, which defaults to
.Pa /etc/src-env.conf .
Some examples that may only be set in this file are
.Va WITH_DIRDEPS_BUILD ,
and
.Va WITH_META_MODE
as they are environment-only variables.
Note that
.Va MAKEOBJDIRPREFIX
may be set here only when using
.Va WITH_DIRDEPS_BUILD .
.Pp
The values of variables are ignored regardless of their setting;
even if they would be set to
.Dq Li FALSE
or
.Dq Li NO .
Just the existence of an option will cause
it to be honoured by
.Xr make 1 .
.Pp
The following list provides a name and short description for variables
that can be used for source builds.
.Bl -tag -width indent
.It Va WITHOUT_ACCT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ACCT 223201 2011-06-17 20:47:44Z ed
>>>>>>> origin/freebsd/11-stable/master
Set to not build process accounting tools such as
.Xr accton 8
and
.Xr sa 8 .
.It Va WITHOUT_ACPI
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ACPI 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr acpiconf 8 ,
.Xr acpidump 8
and related programs.
.It Va WITHOUT_AMD
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_AMD 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr amd 8 ,
and related programs.
.It Va WITHOUT_APM
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_APM 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr apm 8 ,
.Xr apmd 8
and related programs.
.It Va WITHOUT_ASSERT_DEBUG
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ASSERT_DEBUG 162215 2006-09-11 13:55:27Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to compile programs and libraries without the
.Xr assert 3
checks.
.It Va WITHOUT_AT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_AT 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr at 1
and related utilities.
.It Va WITHOUT_ATM
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" $FreeBSD$
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" $FreeBSD$
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_AUTOFS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ATM 156932 2006-03-21 07:50:50Z ru
Set to not build
programs and libraries related to ATM networking.
.It Va WITHOUT_AUDIT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_AUDIT 156932 2006-03-21 07:50:50Z ru
Set to not build audit support into system programs.
.It Va WITHOUT_AUTHPF
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_AUTHPF 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr authpf 8 .
.It Va WITHOUT_AUTOFS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_AUTOFS 296264 2016-03-01 11:36:10Z trasz
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr autofs 5
related programs, libraries, and kernel modules.
.It Va WITH_AUTO_OBJ
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_AUTO_OBJ 284708 2015-06-22 20:21:57Z sjg
>>>>>>> origin/freebsd/11-stable/master
Enable automatic creation of objdirs.
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_BHYVE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BHYVE 277727 2015-01-26 06:44:48Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr bhyve 8 ,
associated utilities, and examples.
.Pp
This option only affects amd64/amd64.
.It Va WITHOUT_BINUTILS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BINUTILS 286332 2015-08-05 18:30:00Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install binutils (as, ld, objcopy, and objdump ) as part
of the normal system build.
The resulting system cannot build programs from source.
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_BINUTILS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_BINUTILS 295491 2016-02-11 00:14:00Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to build and install binutils (as, ld, objcopy, and objdump) as part
of the normal system build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_BINUTILS_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BINUTILS_BOOTSTRAP 295490 2016-02-10 23:57:09Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to not build binutils (as, ld, objcopy and objdump)
as part of the bootstrap process.
.Bf -symbolic
The option does not work for build targets unless some alternative
toolchain is provided.
.Ef
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_BINUTILS_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_BINUTILS_BOOTSTRAP 295491 2016-02-11 00:14:00Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set build binutils (as, ld, objcopy and objdump)
as part of the bootstrap process.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_BLACKLIST
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BLACKLIST 301554 2016-06-07 16:35:55Z lidl
>>>>>>> origin/freebsd/11-stable/master
Set this if you do not want to build blacklistd / blacklistctl.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BLACKLIST_SUPPORT
.El
.It Va WITHOUT_BLACKLIST_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BLACKLIST_SUPPORT 301554 2016-06-07 16:35:55Z lidl
>>>>>>> origin/freebsd/11-stable/master
Set to build some programs without blacklistd support, like
.Xr fingerd 8 ,
.Xr ftpd 8 ,
.Xr rlogind 8 ,
.Xr rshd 8 ,
and
.Xr sshd 8 .
.It Va WITHOUT_BLUETOOTH
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BOOT
.\" $FreeBSD$
Set to not build the boot blocks and loader.
.It Va WITHOUT_BOOTPARAMD
.\" $FreeBSD$
Set to not build or install
.Xr bootparamd 8 .
.It Va WITHOUT_BOOTPD
.\" $FreeBSD$
Set to not build or install
.Xr bootpd 8 .
.It Va WITHOUT_BSDINSTALL
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BLUETOOTH 156932 2006-03-21 07:50:50Z ru
Set to not build Bluetooth related kernel modules, programs and libraries.
.It Va WITHOUT_BOOT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BOOT 156932 2006-03-21 07:50:50Z ru
Set to not build the boot blocks and loader.
.It Va WITHOUT_BOOTPARAMD
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BOOTPARAMD 278192 2015-02-04 10:19:32Z ngie
Set to not build or install
.Xr bootparamd 8 .
.It Va WITHOUT_BOOTPD
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BOOTPD 278192 2015-02-04 10:19:32Z ngie
Set to not build or install
.Xr bootpd 8 .
.It Va WITHOUT_BSDINSTALL
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BSDINSTALL 277677 2015-01-25 04:43:13Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr bsdinstall 8 ,
.Xr sade 8 ,
and related programs.
.It Va WITHOUT_BSD_CPIO
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build the BSD licensed version of cpio based on
.Xr libarchive 3 .
.It Va WITH_BSD_GREP
.\" $FreeBSD$
Install BSD-licensed grep as '[ef]grep' instead of GNU grep.
.It Va WITHOUT_BSNMP
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BSD_CPIO 179813 2008-06-16 05:48:15Z dougb
Set to not build the BSD licensed version of cpio based on
.Xr libarchive 3 .
.It Va WITH_BSD_GREP
.\" from FreeBSD: stable/11/tools/build/options/WITH_BSD_GREP 222273 2011-05-25 01:04:12Z obrien
Install BSD-licensed grep as '[ef]grep' instead of GNU grep.
.It Va WITHOUT_BSNMP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BSNMP 183306 2008-09-23 16:15:42Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr bsnmpd 1
and related libraries and data files.
.It Va WITHOUT_BZIP2
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BZIP2 174550 2007-12-12 16:43:17Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build contributed bzip2 software as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BZIP2_SUPPORT
.El
.It Va WITHOUT_BZIP2_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to build some programs without optional bzip2 support.
.It Va WITHOUT_CALENDAR
.\" $FreeBSD$
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CAPSICUM
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_BZIP2_SUPPORT 166255 2007-01-26 10:19:08Z delphij
Set to build some programs without optional bzip2 support.
.It Va WITHOUT_CALENDAR
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CALENDAR 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr calendar 1 .
.It Va WITHOUT_CAPSICUM
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CAPSICUM 229319 2012-01-02 21:57:58Z rwatson
>>>>>>> origin/freebsd/11-stable/master
Set to not build Capsicum support into system programs.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CASPER
.El
.It Va WITHOUT_CASPER
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build Casper program and related libraries.
.It Va WITH_CCACHE_BUILD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CASPER 258838 2013-12-02 08:21:28Z pjd
Set to not build Casper program and related libraries.
.It Va WITH_CCACHE_BUILD
.\" from FreeBSD: stable/11/tools/build/options/WITH_CCACHE_BUILD 297436 2016-03-30 23:53:12Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set to use
.Xr ccache 1
for the build.
No configuration is required except to install the
.Sy devel/ccache
package.
Using with
.Xr distcc 1
should set
.Sy CCACHE_PREFIX=/usr/local/bin/distcc .
The default cache directory of
.Pa $HOME/.ccache
will be used, which can be overridden by setting
.Sy CCACHE_DIR .
The
.Sy CCACHE_COMPILERCHECK
option defaults to
.Sy content
when using the in-tree bootstrap compiler,
and
.Sy mtime
when using an external compiler.
The
.Sy CCACHE_CPP2
option is used for Clang but not GCC.
.Pp
Sharing a cache between multiple work directories requires using a layout
similar to
.Pa /some/prefix/src
.Pa /some/prefix/obj
and an environment such as:
.Bd -literal -offset indent
CCACHE_BASEDIR='${SRCTOP:H}' MAKEOBJDIRPREFIX='${SRCTOP:H}/obj'
.Ed
.Pp
See
.Xr ccache 1
for more configuration options.
.It Va WITHOUT_CCD
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CCD 277678 2015-01-25 04:52:48Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr geom_ccd 4
and related utilities.
.It Va WITHOUT_CDDL
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CDDL 163861 2006-11-01 09:02:11Z jb
>>>>>>> origin/freebsd/11-stable/master
Set to not build code licensed under Sun's CDDL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CTF
.It
.Va WITHOUT_ZFS
.El
.It Va WITHOUT_CLANG
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CLANG 264660 2014-04-18 17:03:58Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to not build the Clang C/C++ compiler during the regular phase of the build.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.El
.It Va WITH_CLANG
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CLANG 264660 2014-04-18 17:03:58Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to build the Clang C/C++ compiler during the normal phase of the build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_CLANG_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CLANG_BOOTSTRAP 273177 2014-10-16 18:28:11Z skreuzer
>>>>>>> origin/freebsd/11-stable/master
Set to not build the Clang C/C++ compiler during the bootstrap phase of the build.
You must enable either gcc or clang bootstrap to be able to build the system,
unless an alternative compiler is provided via
XCC.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_CLANG_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CLANG_BOOTSTRAP 264660 2014-04-18 17:03:58Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to build the Clang C/C++ compiler during the bootstrap phase of the build.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_CLANG_EXTRAS
<<<<<<< HEAD
.\" $FreeBSD$
Set to build additional clang and llvm tools, such as bugpoint.
.It Va WITHOUT_CLANG_FULL
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CLANG_EXTRAS 231057 2012-02-05 23:56:22Z dim
Set to build additional clang and llvm tools, such as bugpoint.
.It Va WITHOUT_CLANG_FULL
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CLANG_FULL 246259 2013-02-02 22:28:29Z dim
>>>>>>> origin/freebsd/11-stable/master
Set to avoid building the ARCMigrate, Rewriter and StaticAnalyzer components of
the Clang C/C++ compiler.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32 and sparc64/sparc64.
.It Va WITH_CLANG_FULL
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CLANG_FULL 246259 2013-02-02 22:28:29Z dim
>>>>>>> origin/freebsd/11-stable/master
Set to build the ARCMigrate, Rewriter and StaticAnalyzer components of the
Clang C/C++ compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386, pc98/i386, powerpc/powerpc and powerpc/powerpc64.
.It Va WITHOUT_CLANG_IS_CC
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CLANG_IS_CC 242629 2012-11-05 21:53:23Z brooks
>>>>>>> origin/freebsd/11-stable/master
Set to install the GCC compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_CLANG_IS_CC
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CLANG_IS_CC 235342 2012-05-12 16:12:36Z gjb
>>>>>>> origin/freebsd/11-stable/master
Set to install the Clang C/C++ compiler as
.Pa /usr/bin/cc ,
.Pa /usr/bin/c++
and
.Pa /usr/bin/cpp .
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITHOUT_CPP
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CROSS_COMPILER
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CPP 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr cpp 1 .
.It Va WITHOUT_CROSS_COMPILER
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CROSS_COMPILER 275138 2014-11-26 20:43:09Z gjb
>>>>>>> origin/freebsd/11-stable/master
Set to not build any cross compiler in the cross-tools stage of buildworld.
If you are compiling a different version of
.Fx
than what is installed on the system, you will need to provide an alternate
compiler with XCC to ensure success.
If you are compiling with an identical version of
.Fx
to the host, this option may be safely used.
This option may also be safe when the host version of
.Fx
is close to the sources being built, but all bets are off if there have
been any changes to the toolchain between the versions.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BINUTILS_BOOTSTRAP
.It
.Va WITHOUT_CLANG_BOOTSTRAP
.It
.Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
.It
.Va WITHOUT_GCC_BOOTSTRAP
.El
.It Va WITHOUT_CRYPT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CRYPT 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build any crypto code.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.It
.Va WITHOUT_OPENSSL
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITH_CTF
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_CTF 228159 2011-11-30 18:22:44Z fjoe
>>>>>>> origin/freebsd/11-stable/master
Set to compile with CTF (Compact C Type Format) data.
CTF data encapsulates a reduced form of debugging information
similar to DWARF and the venerable stabs and is required for DTrace.
.It Va WITHOUT_CTM
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CTM 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr ctm 1
and related utilities.
.It Va WITHOUT_CUSE
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build CUSE-related programs and libraries.
.It Va WITHOUT_CXX
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CUSE 270171 2014-08-19 15:40:26Z hselasky
Set to not build CUSE-related programs and libraries.
.It Va WITHOUT_CXX
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_CXX 281053 2015-04-03 23:55:04Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr c++ 1
and related libraries.
It will also prevent building of
.Xr gperf 1
and
.Xr devd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_GNUCXX
.It
.Va WITHOUT_GROFF
.El
.It Va WITHOUT_DEBUG_FILES
<<<<<<< HEAD
.\" $FreeBSD$
Set to avoid building or installing standalone debug files for each
executable binary and shared library.
.It Va WITHOUT_DICT
.\" $FreeBSD$
Set to not build the Webster dictionary files.
.It Va WITH_DIRDEPS_BUILD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_DEBUG_FILES 290059 2015-10-27 20:49:56Z emaste
Set to avoid building or installing standalone debug files for each
executable binary and shared library.
.It Va WITHOUT_DICT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_DICT 156932 2006-03-21 07:50:50Z ru
Set to not build the Webster dictionary files.
.It Va WITH_DIRDEPS_BUILD
.\" from FreeBSD: stable/11/tools/build/options/WITH_DIRDEPS_BUILD 298007 2016-04-14 22:00:49Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
This is an experimental build system.
For details see
http://www.crufty.net/sjg/docs/freebsd-meta-mode.htm.
Build commands can be seen from the top-level with:
.Dl make show-valid-targets
The build is driven by dirdeps.mk using
.Va DIRDEPS
stored in
Makefile.depend files found in each directory.
.Pp
The build can be started from anywhere, and behaves the same.
The initial instance of
.Xr make 1 
recursively reads
.Va DIRDEPS
from Makefile.depend
computing a graph of tree dependencies from the current origin.
Setting
.Va NO_DIRDEPS
will skip checking dirdep dependencies and will only build in the current
and child directories.
.Va NO_DIRDEPS_BELOW
will skip building any dirdeps and only build the current directory.
.Pp
This also utilizes the
.Va WITH_META_MODE
logic for incremental builds.
.Pp
The build will hide commands ran unless
.Va NO_SILENT
is defined.
.Pp
Note that there is currently no mass install feature for this.
.Pp
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITH_INSTALL_AS_USER
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_SYSTEM_COMPILER
(unless
.Va WITH_SYSTEM_COMPILER
is set explicitly)
.It Va WITH_AUTO_OBJ
(unless
.Va WITHOUT_AUTO_OBJ
is set explicitly)
.It Va WITH_META_MODE
(unless
.Va WITHOUT_META_MODE
is set explicitly)
.It Va WITH_STAGING
(unless
.Va WITHOUT_STAGING
is set explicitly)
.It Va WITH_STAGING_MAN
(unless
.Va WITHOUT_STAGING_MAN
is set explicitly)
.It Va WITH_STAGING_PROG
(unless
.Va WITHOUT_STAGING_PROG
is set explicitly)
.It Va WITH_SYSROOT
(unless
.Va WITHOUT_SYSROOT
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_DIRDEPS_CACHE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_DIRDEPS_CACHE 290816 2015-11-14 03:24:48Z sjg
>>>>>>> origin/freebsd/11-stable/master
Cache result of dirdeps.mk which can save significant time
for subsequent builds.
Depends on
.Va WITH_DIRDEPS_BUILD .
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_DMAGENT
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build dma Mail Transport Agent
.It Va WITHOUT_DOCCOMPRESS
.\" $FreeBSD$
Set to not to install compressed system documentation.
Only the uncompressed version will be installed.
.It Va WITH_DTRACE_TESTS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_DMAGENT 262335 2014-02-22 13:05:23Z bapt
Set to not build dma Mail Transport Agent
.It Va WITHOUT_DOCCOMPRESS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_DOCCOMPRESS 266752 2014-05-27 15:52:27Z gjb
Set to not to install compressed system documentation.
Only the uncompressed version will be installed.
.It Va WITH_DTRACE_TESTS
.\" from FreeBSD: stable/11/tools/build/options/WITH_DTRACE_TESTS 286174 2015-08-02 00:37:33Z markj
>>>>>>> origin/freebsd/11-stable/master
Set to build and install the DTrace test suite in
.Pa /usr/tests/cddl/usr.sbin/dtrace .
This test suite is considered experimental on architectures other than
amd64/amd64 and running it may cause system instability.
.It Va WITHOUT_DYNAMICROOT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_DYNAMICROOT 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set this if you do not want to link
.Pa /bin
and
.Pa /sbin
dynamically.
.It Va WITHOUT_ED_CRYPTO
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ED_CRYPTO 235660 2012-05-19 20:05:27Z marcel
>>>>>>> origin/freebsd/11-stable/master
Set to build
.Xr ed 1
without support for encryption/decryption.
.It Va WITHOUT_EE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_EE 277663 2015-01-25 00:03:44Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build and install
.Xr edit 1 ,
.Xr ee 1 ,
and related programs.
.It Va WITH_EISA
<<<<<<< HEAD
.\" $FreeBSD$
Set to build EISA kernel modules.
.It Va WITHOUT_ELFCOPY_AS_OBJCOPY
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_EISA 264654 2014-04-18 16:53:06Z imp
Set to build EISA kernel modules.
.It Va WITHOUT_ELFCOPY_AS_OBJCOPY
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ELFCOPY_AS_OBJCOPY 296193 2016-02-29 16:39:38Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to build and install
.Xr objcopy 1
from GNU Binutils, instead of the one from ELF Tool Chain.
This option is provided as a transition aid and will be removed in due time.
.It Va WITHOUT_ELFTOOLCHAIN_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ELFTOOLCHAIN_BOOTSTRAP 295491 2016-02-11 00:14:00Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to not build ELF Tool Chain tools
(addr2line, nm, size, strings and strip)
as part of the bootstrap process.
.Bf -symbolic
An alternate bootstrap tool chain must be provided.
.Ef
.It Va WITHOUT_EXAMPLES
<<<<<<< HEAD
.\" $FreeBSD$
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITH_EXTRA_TCP_STACKS
.\" $FreeBSD$
Set to build extra TCP stack modules.
.It Va WITHOUT_FDT
.\" $FreeBSD$
Set to not build Flattened Device Tree support as part of the base system.
This includes the device tree compiler (dtc) and libfdt support library.
.It Va WITHOUT_FILE
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_EXAMPLES 156938 2006-03-21 09:06:24Z ru
Set to avoid installing examples to
.Pa /usr/share/examples/ .
.It Va WITH_EXTRA_TCP_STACKS
.\" from FreeBSD: stable/11/tools/build/options/WITH_EXTRA_TCP_STACKS 302247 2016-06-28 13:37:01Z jtl
Set to build extra TCP stack modules.
.It Va WITHOUT_FDT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FDT 221539 2011-05-06 19:10:27Z ru
Set to not build Flattened Device Tree support as part of the base system.
This includes the device tree compiler (dtc) and libfdt support library.
.It Va WITHOUT_FILE
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FILE 278193 2015-02-04 10:24:40Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr file 1
and related programs.
.It Va WITHOUT_FINGER
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FINGER 278192 2015-02-04 10:19:32Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr finger 1
and
.Xr fingerd 8 .
.It Va WITHOUT_FLOPPY
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build or install programs
for operating floppy disk driver.
.It Va WITHOUT_FMTREE
.\" $FreeBSD$
Set to not build and install
.Pa /usr/sbin/fmtree .
.It Va WITHOUT_FORMAT_EXTENSIONS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FLOPPY 221540 2011-05-06 19:13:03Z ru
Set to not build or install programs
for operating floppy disk driver.
.It Va WITHOUT_FMTREE
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FMTREE 261299 2014-01-30 21:37:43Z brooks
Set to not build and install
.Pa /usr/sbin/fmtree .
.It Va WITHOUT_FORMAT_EXTENSIONS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FORMAT_EXTENSIONS 250658 2013-05-15 13:04:10Z brooks
>>>>>>> origin/freebsd/11-stable/master
Set to not enable
.Fl fformat-extensions
when compiling the kernel.
Also disables all format checking.
.It Va WITHOUT_FORTH
<<<<<<< HEAD
.\" $FreeBSD$
Set to build bootloaders without Forth support.
.It Va WITHOUT_FP_LIBC
.\" $FreeBSD$
Set to build
.Nm libc
without floating-point support.
.It Va WITH_FREEBSD_UPDATE
.\" $FreeBSD$
Set to build
.Xr freebsd-update 8 .
.It Va WITHOUT_FTP
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FORTH 156932 2006-03-21 07:50:50Z ru
Set to build bootloaders without Forth support.
.It Va WITHOUT_FP_LIBC
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FP_LIBC 156932 2006-03-21 07:50:50Z ru
Set to build
.Nm libc
without floating-point support.
.It Va WITHOUT_FREEBSD_UPDATE
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FREEBSD_UPDATE 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr freebsd-update 8 .
.It Va WITHOUT_FTP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_FTP 278192 2015-02-04 10:19:32Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr ftp 1
and
.Xr ftpd 8 .
.It Va WITHOUT_GAMES
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build games.
.It Va WITHOUT_GCC
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GAMES 156932 2006-03-21 07:50:50Z ru
Set to not build games.
.It Va WITHOUT_GCC
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GCC 264660 2014-04-18 17:03:58Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to not build and install gcc and g++ as part of the normal build process.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GCC
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_GCC 255326 2013-09-06 20:49:48Z zeising
>>>>>>> origin/freebsd/11-stable/master
Set to build and install gcc and g++.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GCC_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GCC_BOOTSTRAP 273177 2014-10-16 18:28:11Z skreuzer
>>>>>>> origin/freebsd/11-stable/master
Set to not build gcc and g++ as part of the bootstrap process.
You must enable either gcc or clang bootstrap to be able to build the system,
unless an alternative compiler is provided via
XCC.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GCC_BOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_GCC_BOOTSTRAP 264660 2014-04-18 17:03:58Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to build gcc and g++ as part of the bootstrap process.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GCOV
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GCOV 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build the
.Xr gcov 1
tool.
.It Va WITHOUT_GDB
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GDB 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr gdb 1 .
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITH_GDB
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_GDB 295493 2016-02-11 00:30:51Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to build
.Xr gdb 1 .
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GNU
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GNU 174550 2007-12-12 16:43:17Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build contributed GNU software as a part of the base system.
This option can be useful if the system built must not contain any code
covered by the GNU Public License due to legal reasons.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GNU_SUPPORT
.El
.It Va WITHOUT_GNUCXX
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GNUCXX 255321 2013-09-06 20:08:03Z theraven
>>>>>>> origin/freebsd/11-stable/master
Do not build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where clang is the system compiler.
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, arm64/aarch64, i386/i386 and pc98/i386.
.It Va WITH_GNUCXX
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_GNUCXX 255321 2013-09-06 20:08:03Z theraven
>>>>>>> origin/freebsd/11-stable/master
Build the GNU C++ stack (g++, libstdc++).
This is the default on platforms where gcc is the system compiler.
.Pp
It is a default setting on
mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_GNU_GREP_COMPAT
<<<<<<< HEAD
.\" $FreeBSD$
Set this option to omit the gnu extensions to grep from being included in
BSD grep.
.It Va WITHOUT_GNU_SUPPORT
.\" $FreeBSD$
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIO
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GNU_GREP_COMPAT 273421 2014-10-21 20:44:33Z emaste
Set this option to omit the gnu extensions to grep from being included in
BSD grep.
.It Va WITHOUT_GNU_SUPPORT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GNU_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build some programs without optional GNU support.
.It Va WITHOUT_GPIO
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GPIO 228081 2011-11-28 17:54:34Z dim
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr gpioctl 8
as part of the base system.
.It Va WITHOUT_GPL_DTC
<<<<<<< HEAD
.\" $FreeBSD$
Set to build the BSD licensed version of the device tree compiler, instead of the
GPL'd one from elinux.org.
.It Va WITHOUT_GROFF
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GPL_DTC 264515 2014-04-15 20:41:55Z imp
Set to build the BSD licensed version of the device tree compiler, instead of the
GPL'd one from elinux.org.
.It Va WITHOUT_GROFF
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GROFF 218941 2011-02-22 08:13:49Z uqs
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr groff 1
and
.Xr vgrind 1 .
You should consider installing the textproc/groff port to not break
.Xr man 1 .
.It Va WITHOUT_GSSAPI
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build libgssapi.
.It Va WITHOUT_HAST
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_GSSAPI 174548 2007-12-12 16:39:32Z ru
Set to not build libgssapi.
.It Va WITHOUT_HAST
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_HAST 277725 2015-01-26 06:27:07Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr hastd 8
and related utilities.
.It Va WITHOUT_HBSD_UPDATE
.\" $HardenedBSD$
Set to not build
.Xr hbsd-update 8 
and
.Xr hbsd-update-build 8 .
.It Va WITH_HESIOD
<<<<<<< HEAD
.\" $FreeBSD$
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" $FreeBSD$
Set to not build HTML docs.
.It Va WITHOUT_HYPERV
.\" $FreeBSD$
Set to not build or install HyperV utilities.
.It Va WITHOUT_ICONV
.\" $FreeBSD$
Set to not build iconv as part of libc.
.It Va WITHOUT_INCLUDES
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_HESIOD 156932 2006-03-21 07:50:50Z ru
Set to build Hesiod support.
.It Va WITHOUT_HTML
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_HTML 156932 2006-03-21 07:50:50Z ru
Set to not build HTML docs.
.It Va WITHOUT_HYPERV
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_HYPERV 271493 2014-09-13 02:15:31Z delphij
Set to not build or install HyperV utilities.
.It Va WITHOUT_ICONV
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ICONV 254919 2013-08-26 17:15:56Z antoine
Set to not build iconv as part of libc.
.It Va WITHOUT_INCLUDES
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INCLUDES 275138 2014-11-26 20:43:09Z gjb
>>>>>>> origin/freebsd/11-stable/master
Set to not install header files.
This option used to be spelled
.Va NO_INCS .
.Bf -symbolic
The option does not work for build targets.
.Ef
.It Va WITHOUT_INET
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INET 221266 2011-04-30 17:58:28Z bz
>>>>>>> origin/freebsd/11-stable/master
Set to not build programs and libraries related to IPv4 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET_SUPPORT
.El
.It Va WITHOUT_INET6
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INET6 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
programs and libraries related to IPv6 networking.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_INET6_SUPPORT
.El
.It Va WITHOUT_INET6_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INETD
.\" $FreeBSD$
Set to not build
.Xr inetd 8 .
.It Va WITHOUT_INET_SUPPORT
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without IPv4 support.
.It Va WITHOUT_INSTALLLIB
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INET6_SUPPORT 156932 2006-03-21 07:50:50Z ru
Set to build libraries, programs, and kernel modules without IPv6 support.
.It Va WITHOUT_INETD
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INETD 278192 2015-02-04 10:19:32Z ngie
Set to not build
.Xr inetd 8 .
.It Va WITHOUT_INET_SUPPORT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INET_SUPPORT 221266 2011-04-30 17:58:28Z bz
Set to build libraries, programs, and kernel modules without IPv4 support.
.It Va WITHOUT_INSTALLLIB
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_INSTALLLIB 297941 2016-04-13 21:01:58Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set this if you do not want to install optional libraries.
For example when creating a
.Xr nanobsd 8
image.
.Bf -symbolic
The option does not work for build targets.
.Ef
.It Va WITH_INSTALL_AS_USER
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_INSTALL_AS_USER 238021 2012-07-02 20:24:01Z marcel
>>>>>>> origin/freebsd/11-stable/master
Set to make install targets succeed for non-root users by installing
files with owner and group attributes set to that of the user running
the
.Xr make 1
command.
The user still has to set the
.Va DESTDIR
variable to point to a directory where the user has write permissions.
.It Va WITHOUT_IPFILTER
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build IP Filter package.
.It Va WITHOUT_IPFW
.\" $FreeBSD$
Set to not build IPFW tools.
.It Va WITHOUT_ISCSI
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_IPFILTER 156932 2006-03-21 07:50:50Z ru
Set to not build IP Filter package.
.It Va WITHOUT_IPFW
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_IPFW 183242 2008-09-21 22:02:26Z sam
Set to not build IPFW tools.
.It Va WITHOUT_ISCSI
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ISCSI 277675 2015-01-25 04:20:11Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr iscid 8
and related utilities.
.It Va WITHOUT_JAIL
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build tools for the support of jails; e.g.,
.Xr jail 8 .
.It Va WITHOUT_KDUMP
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_JAIL 249966 2013-04-27 04:09:09Z eadler
Set to not build tools for the support of jails; e.g.,
.Xr jail 8 .
.It Va WITHOUT_KDUMP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KDUMP 240690 2012-09-19 11:38:37Z zeising
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr kdump 1
and
.Xr truss 1 .
.It Va WITHOUT_KERBEROS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KERBEROS 174549 2007-12-12 16:42:03Z ru
>>>>>>> origin/freebsd/11-stable/master
Set this if you do not want to build Kerberos 5 (KTH Heimdal).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS_SUPPORT
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_KERBEROS_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KERBEROS_SUPPORT 251794 2013-06-15 20:29:07Z eadler
>>>>>>> origin/freebsd/11-stable/master
Set to build some programs without Kerberos support, like
.Xr ssh 1 ,
.Xr telnet 1 ,
.Xr sshd 8 ,
and
.Xr telnetd 8 .
.It Va WITHOUT_KERNEL_SYMBOLS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KERNEL_SYMBOLS 222189 2011-05-22 18:23:17Z imp
>>>>>>> origin/freebsd/11-stable/master
Set to not install kernel symbol files.
.Bf -symbolic
This option is recommended for those people who have small root partitions.
.Ef
.It Va WITHOUT_KVM
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KVM 174550 2007-12-12 16:43:17Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build the
.Nm libkvm
library as a part of the base system.
.Bf -symbolic
The option has no effect yet.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KVM_SUPPORT
.El
.It Va WITHOUT_KVM_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_KVM_SUPPORT 170644 2007-06-13 02:08:04Z sepotvin
>>>>>>> origin/freebsd/11-stable/master
Set to build some programs without optional
.Nm libkvm
support.
.It Va WITHOUT_LDNS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LDNS 255591 2013-09-15 13:11:13Z des
>>>>>>> origin/freebsd/11-stable/master
Setting this variable will prevent the LDNS library from being built.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LDNS_UTILS
.It
.Va WITHOUT_UNBOUND
.El
.It Va WITHOUT_LDNS_UTILS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LDNS_UTILS 255850 2013-09-24 14:33:31Z des
>>>>>>> origin/freebsd/11-stable/master
Setting this variable will prevent building the LDNS utilities
.Xr drill 1
and
.Xr host 1 .
.It Va WITHOUT_LEGACY_CONSOLE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LEGACY_CONSOLE 296264 2016-03-01 11:36:10Z trasz
>>>>>>> origin/freebsd/11-stable/master
Set to not build programs that support a legacy PC console; e.g.,
.Xr kbdcontrol 1
and
.Xr vidcontrol 1 .
<<<<<<< HEAD
.It Va WITH_LIB32
.\" $FreeBSD$
On 64-bit platforms, set to build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBCPLUSPLUS
.\" $FreeBSD$
Set to avoid building libcxxrt and libc++.
.It Va WITHOUT_LIBPTHREAD
.\" $FreeBSD$
=======
.It Va WITHOUT_LIB32
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LIB32 274664 2014-11-18 17:06:48Z imp
On 64-bit platforms, set to not build 32-bit library set and a
.Nm ld-elf32.so.1
runtime linker.
.It Va WITHOUT_LIBCPLUSPLUS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LIBCPLUSPLUS 246262 2013-02-02 22:42:46Z dim
Set to avoid building libcxxrt and libc++.
.It Va WITHOUT_LIBPTHREAD
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LIBPTHREAD 188848 2009-02-20 11:09:55Z mtm
>>>>>>> origin/freebsd/11-stable/master
Set to not build the
.Nm libpthread
providing library,
.Nm libthr .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_LIBTHR
.El
.It Va WITH_LIBSOFT
<<<<<<< HEAD
.\" $FreeBSD$
On armv6 only, set to enable soft float ABI compatibility libraries.
This option is for transitioning to the new hard float ABI.
.It Va WITHOUT_LIBTHR
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_LIBSOFT 300325 2016-05-20 19:23:07Z bdrewery
On armv6 only, set to enable soft float ABI compatibility libraries.
This option is for transitioning to the new hard float ABI.
.It Va WITHOUT_LIBTHR
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LIBTHR 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build the
.Nm libthr
(1:1 threading)
library.
.It Va WITHOUT_LLDB
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LLDB 289275 2015-10-14 00:23:31Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to not build the LLDB debugger.
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_LLDB
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_LLDB 255722 2013-09-20 01:52:02Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to build the LLDB debugger.
.Pp
It is a default setting on
amd64/amd64 and arm64/aarch64.
.It Va WITHOUT_LLVM_LIBUNWIND
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LLVM_LIBUNWIND 293450 2016-01-09 00:42:07Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to use GCC's stack unwinder (instead of LLVM's libunwind).
.Pp
It is a default setting on
amd64/amd64, arm/arm, arm/armeb, arm/armv6, i386/i386, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, pc98/i386, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITH_LLVM_LIBUNWIND
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_LLVM_LIBUNWIND 293450 2016-01-09 00:42:07Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to use LLVM's libunwind stack unwinder (instead of GCC's unwinder).
.Pp
It is a default setting on
arm64/aarch64.
.It Va WITHOUT_LOCALES
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LOCATE
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LOCALES 156932 2006-03-21 07:50:50Z ru
Set to not build localization files; see
.Xr locale 1 .
.It Va WITHOUT_LOCATE
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LOCATE 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr locate 1
and related programs.
.It Va WITHOUT_LPR
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LPR 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr lpr 1
and related programs.
.It Va WITHOUT_LS_COLORS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LS_COLORS 235660 2012-05-19 20:05:27Z marcel
>>>>>>> origin/freebsd/11-stable/master
Set to build
.Xr ls 1
without support for colors to distinguish file types.
.It Va WITHOUT_LZMA_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to build some programs without optional lzma compression support.
.It Va WITHOUT_MAIL
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_LZMA_SUPPORT 245171 2013-01-08 18:37:12Z obrien
Set to build some programs without optional lzma compression support.
.It Va WITHOUT_MAIL
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MAIL 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build any mail support (MUA or MTA).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DMAGENT
.It
.Va WITHOUT_MAILWRAPPER
.It
.Va WITHOUT_SENDMAIL
.El
.It Va WITHOUT_MAILWRAPPER
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MAILWRAPPER 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build the
.Xr mailwrapper 8
MTA selector.
.It Va WITHOUT_MAKE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MAKE 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not install
.Xr make 1
and related support files.
.It Va WITHOUT_MAN
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MAN 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build manual pages.
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_MAN_UTILS
(unless
.Va WITH_MAN_UTILS
is set explicitly)
.El
.It Va WITHOUT_MANCOMPRESS
<<<<<<< HEAD
.\" $FreeBSD$
Set to not to install compressed man pages.
Only the uncompressed versions will be installed.
.It Va WITHOUT_MANDOCDB
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MANCOMPRESS 266752 2014-05-27 15:52:27Z gjb
Set to not to install compressed man pages.
Only the uncompressed versions will be installed.
.It Va WITHOUT_MANDOCDB
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MANDOCDB 283777 2015-05-30 17:41:37Z bapt
>>>>>>> origin/freebsd/11-stable/master
Use the
.Xr mandoc 1
version of
.Xr makewhatis 8
database and utilities.
.It Va WITHOUT_MAN_UTILS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_MAN_UTILS 208322 2010-05-20 00:07:21Z jkim
>>>>>>> origin/freebsd/11-stable/master
Set to not build utilities for manual pages,
.Xr apropos 1 ,
.Xr catman 1 ,
.Xr makewhatis 1 ,
.Xr man 1 ,
.Xr whatis 1 ,
.Xr manctl 8 ,
and related support files.
.It Va WITH_META_MODE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_META_MODE 301889 2016-06-14 16:20:25Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Creates
.Xr make 1
meta files when building, which can provide a reliable incremental build when
using
.Xr filemon 4 .
The meta file is created in the OBJDIR as
.Pa target.meta .
These meta files track the command ran, its output, and the current directory.
The
.Xr filemon 4
module is required unless
.Va NO_FILEMON
is defined.
When the module is loaded, any files used by the commands executed will be
tracked as
dependencies for the target in its meta file.
The target will be considered out-of-date and rebuilt if any of the following
are true compared to the last build:
.Bl -bullet -compact
.It
The command to execute changes.
.It
The current working directory changes.
.It
The target's meta file is missing.
.It
The target's meta file is missing filemon data when filemon is loaded
and a previous run did not have it loaded.
.It
[requires
.Xr filemon 4 ]
Files read, executed or linked to are newer than the target.
.It
[requires
.Xr filemon 4 ]
Files read, written, executed or linked are missing.
.El
The meta files can also be useful for debugging.
.Pp
The build will hide commands ran unless
.Va NO_SILENT
is defined.
Errors will cause
.Xr make 1
to show some of its environment for further debugging.
.Pp
The build operates as it normally would otherwise.
This option originally invoked a different build system but that was renamed
to
.Va WITH_DIRDEPS_BUILD .
.Pp
Currently this also enforces
.Va WITHOUT_SYSTEM_COMPILER .
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_SYSTEM_COMPILER
(unless
.Va WITH_SYSTEM_COMPILER
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_NAND
<<<<<<< HEAD
.\" $FreeBSD$
Set to build the NAND Flash components.
.It Va WITHOUT_NDIS
.\" $FreeBSD$
Set to not build programs and libraries
related to NDIS emulation support.
.It Va WITHOUT_NETCAT
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_NAND 235537 2012-05-17 10:11:18Z gber
Set to build the NAND Flash components.
.It Va WITHOUT_NDIS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NDIS 183242 2008-09-21 22:02:26Z sam
Set to not build programs and libraries
related to NDIS emulation support.
.It Va WITHOUT_NETCAT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NETCAT 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr nc 1
utility.
.It Va WITHOUT_NETGRAPH
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NETGRAPH 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build applications to support
.Xr netgraph 4 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_ATM
.It
.Va WITHOUT_BLUETOOTH
.It
.Va WITHOUT_NETGRAPH_SUPPORT
.El
.It Va WITHOUT_NETGRAPH_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without netgraph support.
.It Va WITHOUT_NIS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NETGRAPH_SUPPORT 183305 2008-09-23 16:11:15Z sam
Set to build libraries, programs, and kernel modules without netgraph support.
.It Va WITHOUT_NIS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NIS 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr NIS 8
support and related programs.
If set, you might need to adopt your
.Xr nsswitch.conf 5
and remove
.Sq nis
entries.
.It Va WITHOUT_NLS
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" $FreeBSD$
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_NS_CACHING
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NLS 156932 2006-03-21 07:50:50Z ru
Set to not build NLS catalogs.
.It Va WITHOUT_NLS_CATALOGS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NLS_CATALOGS 156932 2006-03-21 07:50:50Z ru
Set to not build NLS catalog support for
.Xr csh 1 .
.It Va WITHOUT_NS_CACHING
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NS_CACHING 172803 2007-10-19 14:01:25Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to disable name caching in the
.Pa nsswitch
subsystem.
The generic caching daemon,
.Xr nscd 8 ,
will not be built either if this option is set.
.It Va WITHOUT_NTP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_NTP 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr ntpd 8
and related programs.
.It Va WITH_OFED
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_OFED 228081 2011-11-28 17:54:34Z dim
>>>>>>> origin/freebsd/11-stable/master
Set to build the
.Dq "OpenFabrics Enterprise Distribution"
Infiniband software stack.
.It Va WITH_OPENLDAP
<<<<<<< HEAD
.\" $FreeBSD$
Enable building openldap support for kerberos.
.It Va WITHOUT_OPENSSH
.\" $FreeBSD$
Set to not build OpenSSH.
.It Va WITHOUT_OPENSSL
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_OPENLDAP 264902 2014-04-24 23:17:31Z imp
Enable building openldap support for kerberos.
.It Va WITHOUT_OPENSSH
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_OPENSSH 156932 2006-03-21 07:50:50Z ru
Set to not build OpenSSH.
.It Va WITHOUT_OPENSSL
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_OPENSSL 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build OpenSSL.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_KERBEROS
.It
.Va WITHOUT_KERBEROS_SUPPORT
.It
.Va WITHOUT_OPENSSH
.El
.Pp
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITHOUT_GSSAPI
(unless
.Va WITH_GSSAPI
is set explicitly)
.El
.It Va WITHOUT_PAM
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PAM 174550 2007-12-12 16:43:17Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build PAM library and modules.
.Bf -symbolic
This option is deprecated and does nothing.
.Ef
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_PAM_SUPPORT
.El
.It Va WITHOUT_PAM_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PAM_SUPPORT 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to build some programs without PAM support, particularly
.Xr ftpd 8
and
.Xr ppp 8 .
.It Va WITHOUT_PC_SYSINSTALL
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PC_SYSINSTALL 245606 2013-01-18 15:57:09Z eadler
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr pc-sysinstall 8
and related programs.
.It Va WITHOUT_PF
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PF 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build PF firewall package.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_AUTHPF
.El
.It Va WITHOUT_PIE
Disable building of Position-Independent Executables (PIEs).
.Pp
It is a default setting on
arm/arm, arm/armeb, arm/armv6, mips/mipsel, mips/mips, mips/mips64el, mips/mips64, mips/mipsn32, powerpc/powerpc, powerpc/powerpc64 and sparc64/sparc64.
.It Va WITHOUT_PKGBOOTSTRAP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PKGBOOTSTRAP 258924 2013-12-04 15:58:42Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr pkg 7
bootstrap tool.
.It Va WITHOUT_PMC
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build
.Xr pmccontrol 8
and related programs.
.It Va WITH_PORTSNAP
.\" $FreeBSD$
Set to build or install
.Xr portsnap 8
and related files.
.It Va WITHOUT_PPP
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PMC 183242 2008-09-21 22:02:26Z sam
Set to not build
.Xr pmccontrol 8
and related programs.
.It Va WITHOUT_PORTSNAP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PORTSNAP 183242 2008-09-21 22:02:26Z sam
Set to not build or install
.Xr portsnap 8
and related files.
.It Va WITHOUT_PPP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PPP 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr ppp 8
and related programs.
.It Va WITHOUT_PROFILE
<<<<<<< HEAD
.\" $FreeBSD$
Set to avoid compiling profiled libraries.
.It Va WITHOUT_QUOTAS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_PROFILE 228196 2011-12-02 09:09:54Z fjoe
Set to avoid compiling profiled libraries.
.It Va WITHOUT_QUOTAS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_QUOTAS 296264 2016-03-01 11:36:10Z trasz
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr quota 1
and related programs.
.It Va WITHOUT_RADIUS_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_RADIUS_SUPPORT 278182 2015-02-04 06:53:45Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build radius support into various applications, like
.Xr pam_radius 8
and
.Xr ppp 8 .
.It Va WITHOUT_RBOOTD
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build or install
.Xr rbootd 8 .
.It Va WITHOUT_RCMDS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_RBOOTD 278192 2015-02-04 10:19:32Z ngie
Set to not build or install
.Xr rbootd 8 .
.It Va WITHOUT_RCMDS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_RCMDS 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Disable building of the
.Bx
r-commands.
This includes
.Xr rlogin 1 ,
.Xr rsh 1 ,
etc.
.It Va WITHOUT_RCS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_RCS 275138 2014-11-26 20:43:09Z gjb
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr rcs 1 ,
.Xr etcupdate 8 ,
and related utilities.
.It Va WITHOUT_RESCUE
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_ROUTED
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_RESCUE 156932 2006-03-21 07:50:50Z ru
Set to not build
.Xr rescue 8 .
.It Va WITHOUT_ROUTED
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ROUTED 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr routed 8
utility.
.It Va WITHOUT_SENDMAIL
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SENDMAIL 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr sendmail 8
and related programs.
.It Va WITHOUT_SETUID_LOGIN
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SETUID_LOGIN 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set this to disable the installation of
.Xr login 1
as a set-user-ID root program.
.It Va WITHOUT_SHAREDOCS
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITH_SHLIBRANDOM
Enable randomizing the load order of shared objects.
.It Va WITH_SORT_THREADS
.\" $FreeBSD$
Set to enable threads in
.Xr sort 1 .
.It Va WITHOUT_SOURCELESS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SHAREDOCS 156932 2006-03-21 07:50:50Z ru
Set to not build the
.Bx 4.4
legacy docs.
.It Va WITH_SHARED_TOOLCHAIN
.\" from FreeBSD: stable/11/tools/build/options/WITH_SHARED_TOOLCHAIN 235342 2012-05-12 16:12:36Z gjb
Set to build the toolchain binaries shared.
The set includes
.Xr cc 1 ,
.Xr make 1
and necessary utilities like assembler, linker and library archive manager.
.It Va WITH_SORT_THREADS
.\" from FreeBSD: stable/11/tools/build/options/WITH_SORT_THREADS 264158 2014-04-05 18:00:45Z imp
Set to enable threads in
.Xr sort 1 .
.It Va WITHOUT_SOURCELESS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SOURCELESS 230972 2012-02-04 00:54:43Z rmh
>>>>>>> origin/freebsd/11-stable/master
Set to not build kernel modules that include sourceless code (either microcode or native code for host CPU).
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_SOURCELESS_HOST
.It
.Va WITHOUT_SOURCELESS_UCODE
.El
.It Va WITHOUT_SOURCELESS_HOST
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build kernel modules that include sourceless native code for host CPU.
.It Va WITHOUT_SOURCELESS_UCODE
.\" $FreeBSD$
Set to not build kernel modules that include sourceless microcode.
.It Va WITHOUT_SSP
.\" $FreeBSD$
Set to not build world with propolice stack smashing protection.
.It Va WITH_STAGING
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SOURCELESS_HOST 230972 2012-02-04 00:54:43Z rmh
Set to not build kernel modules that include sourceless native code for host CPU.
.It Va WITHOUT_SOURCELESS_UCODE
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SOURCELESS_UCODE 230972 2012-02-04 00:54:43Z rmh
Set to not build kernel modules that include sourceless microcode.
.It Va WITHOUT_SSP
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SSP 180012 2008-06-25 21:33:28Z ru
Set to not build world with propolice stack smashing protection.
.It Va WITH_STAGING
.\" from FreeBSD: stable/11/tools/build/options/WITH_STAGING 290816 2015-11-14 03:24:48Z sjg
>>>>>>> origin/freebsd/11-stable/master
Enable staging of files to a stage tree.
This can be best thought of as auto-install to
.Va DESTDIR
with some extra meta data to ensure dependencies can be tracked.
Depends on
.Va WITH_DIRDEPS_BUILD .
When set, the following options are also in effect:
.Pp
.Bl -inset -compact
.It Va WITH_STAGING_MAN
(unless
.Va WITHOUT_STAGING_MAN
is set explicitly)
.It Va WITH_STAGING_PROG
(unless
.Va WITHOUT_STAGING_PROG
is set explicitly)
.El
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITH_STAGING_MAN
<<<<<<< HEAD
.\" $FreeBSD$
Enable staging of MAN pages to stage tree.
.It Va WITH_STAGING_PROG
.\" $FreeBSD$
Enable staging of PROGs to stage tree.
.It Va WITH_STALE_STAGED
.\" $FreeBSD$
Check staged files are not stale.
.It Va WITH_SVN
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_STAGING_MAN 284708 2015-06-22 20:21:57Z sjg
Enable staging of MAN pages to stage tree.
.It Va WITH_STAGING_PROG
.\" from FreeBSD: stable/11/tools/build/options/WITH_STAGING_PROG 284708 2015-06-22 20:21:57Z sjg
Enable staging of PROGs to stage tree.
.It Va WITH_STALE_STAGED
.\" from FreeBSD: stable/11/tools/build/options/WITH_STALE_STAGED 284708 2015-06-22 20:21:57Z sjg
Check staged files are not stale.
.It Va WITH_SVN
.\" from FreeBSD: stable/11/tools/build/options/WITH_SVN 252561 2013-07-03 12:36:47Z zeising
>>>>>>> origin/freebsd/11-stable/master
Set to install
.Xr svnlite 1
as
.Xr svn 1 .
.It Va WITHOUT_SVNLITE
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SVNLITE 252561 2013-07-03 12:36:47Z zeising
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr svnlite 1
and related programs.
.It Va WITHOUT_SYMVER
<<<<<<< HEAD
.\" $FreeBSD$
Set to disable symbol versioning when building shared libraries.
.It Va WITHOUT_SYSCONS
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SYMVER 169649 2007-05-17 05:03:24Z deischen
Set to disable symbol versioning when building shared libraries.
.It Va WITHOUT_SYSCONS
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SYSCONS 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr syscons 4
support files such as keyboard maps, fonts, and screen output maps.
.It Va WITH_SYSROOT
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITH_SYSROOT 290816 2015-11-14 03:24:48Z sjg
>>>>>>> origin/freebsd/11-stable/master
Enable use of sysroot during build.
Depends on
.Va WITH_DIRDEPS_BUILD .
.Pp
This must be set in the environment, make command line, or
.Pa /etc/src-env.conf ,
not
.Pa /etc/src.conf .
.It Va WITHOUT_SYSTEM_COMPILER
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_SYSTEM_COMPILER 300354 2016-05-21 01:32:23Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set to not opportunistically skip building a cross-compiler during the
bootstrap phase of the build.
Normally, if the currently installed compiler matches the planned bootstrap
compiler type and revision, then it will not be built.
This does not prevent a compiler from being built for installation though,
only for building one for the build itself.
The
.Va WITHOUT_CLANG
and
.Va WITHOUT_GCC
options control those.
.It Va WITHOUT_TALK
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TALK 277676 2015-01-25 04:37:44Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr talk 1
and
.Xr talkd 8 .
.It Va WITHOUT_TCP_WRAPPERS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TCP_WRAPPERS 278192 2015-02-04 10:19:32Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr tcpd 8 ,
and related utilities.
.It Va WITHOUT_TCSH
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TCSH 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Set to not build and install
.Pa /bin/csh
(which is
.Xr tcsh 1 ) .
.It Va WITHOUT_TELNET
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TELNET 296264 2016-03-01 11:36:10Z trasz
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr telnet 1
and related programs.
.It Va WITHOUT_TESTS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TESTS 268778 2014-07-16 21:40:11Z jmmv
>>>>>>> origin/freebsd/11-stable/master
Set to not build nor install the
.Fx
Test Suite in
.Pa /usr/tests/ .
See
.Xr tests 7
for more details.
This also disables the build of all test-related dependencies, including ATF.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_DTRACE_TESTS
.It
.Va WITHOUT_TESTS_SUPPORT
.El
.It Va WITHOUT_TESTS_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to disables the build of all test-related dependencies, including ATF.
.It Va WITHOUT_TEXTPROC
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TESTS_SUPPORT 274665 2014-11-18 17:06:50Z imp
Set to disables the build of all test-related dependencies, including ATF.
.It Va WITHOUT_TEXTPROC
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TEXTPROC 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build
programs used for text processing.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_GROFF
.El
.It Va WITHOUT_TFTP
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TFTP 278192 2015-02-04 10:19:32Z ngie
>>>>>>> origin/freebsd/11-stable/master
Set to not build or install
.Xr tftp 1
and
.Xr tftpd 8 .
.It Va WITHOUT_TIMED
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build or install
.Xr timed 8 .
.It Va WITHOUT_TOOLCHAIN
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TIMED 278192 2015-02-04 10:19:32Z ngie
Set to not build or install
.Xr timed 8 .
.It Va WITHOUT_TOOLCHAIN
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_TOOLCHAIN 297939 2016-04-13 20:55:05Z bdrewery
>>>>>>> origin/freebsd/11-stable/master
Set to not install header or
programs used for program development,
compilers, debuggers etc.
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_BINUTILS
.It
.Va WITHOUT_CLANG
.It
.Va WITHOUT_CLANG_EXTRAS
.It
.Va WITHOUT_CLANG_FULL
.It
.Va WITHOUT_GCC
.It
.Va WITHOUT_GDB
.It
.Va WITHOUT_INCLUDES
.It
.Va WITHOUT_LLDB
.El
.It Va WITHOUT_UNBOUND
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_UNBOUND 255597 2013-09-15 14:51:23Z des
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr unbound 8
and related programs.
.It Va WITHOUT_USB
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build USB-related programs and libraries.
.It Va WITHOUT_USB_GADGET_EXAMPLES
.\" $FreeBSD$
Set to build USB gadget kernel modules.
.It Va WITHOUT_UTMPX
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_USB 156932 2006-03-21 07:50:50Z ru
Set to not build USB-related programs and libraries.
.It Va WITHOUT_USB_GADGET_EXAMPLES
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_USB_GADGET_EXAMPLES 274665 2014-11-18 17:06:50Z imp
Set to build USB gadget kernel modules.
.It Va WITHOUT_UTMPX
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_UTMPX 231530 2012-02-11 20:28:42Z ed
>>>>>>> origin/freebsd/11-stable/master
Set to not build user accounting tools such as
.Xr last 1 ,
.Xr users 1 ,
.Xr who 1 ,
.Xr ac 8 ,
.Xr lastlogin 8
and
.Xr utx 8 .
.It Va WITHOUT_VI
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build and install vi, view, ex and related programs.
.It Va WITHOUT_VT
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_VI 264903 2014-04-24 23:17:40Z imp
Set to not build and install vi, view, ex and related programs.
.It Va WITHOUT_VT
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_VT 268022 2014-06-30 00:20:12Z emaste
>>>>>>> origin/freebsd/11-stable/master
Set to not build
.Xr vt 4
support files (fonts and keymaps).
.It Va WITHOUT_WARNS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_WARNS 276559 2015-01-02 18:57:58Z bapt
>>>>>>> origin/freebsd/11-stable/master
Set this to not add warning flags to the compiler invocations.
Useful as a temporary workaround when code enters the tree
which triggers warnings in environments that differ from the
original developer.
.It Va WITHOUT_WIRELESS
<<<<<<< HEAD
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_WIRELESS 183242 2008-09-21 22:02:26Z sam
>>>>>>> origin/freebsd/11-stable/master
Set to not build programs used for 802.11 wireless networks; especially
.Xr wpa_supplicant 8
and
.Xr hostapd 8 .
When set, it also enforces the following options:
.Pp
.Bl -item -compact
.It
.Va WITHOUT_WIRELESS_SUPPORT
.El
.It Va WITHOUT_WIRELESS_SUPPORT
<<<<<<< HEAD
.\" $FreeBSD$
Set to build libraries, programs, and kernel modules without
802.11 wireless support.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_WIRELESS_SUPPORT 183305 2008-09-23 16:11:15Z sam
Set to build libraries, programs, and kernel modules without
802.11 wireless support.
.It Va WITHOUT_WPA_SUPPLICANT_EAPOL
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_WPA_SUPPLICANT_EAPOL 156932 2006-03-21 07:50:50Z ru
>>>>>>> origin/freebsd/11-stable/master
Build
.Xr wpa_supplicant 8
without support for the IEEE 802.1X protocol and without
support for EAP-PEAP, EAP-TLS, EAP-LEAP, and EAP-TTLS
protocols (usable only via 802.1X).
.It Va WITHOUT_ZFS
<<<<<<< HEAD
.\" $FreeBSD$
Set to not build ZFS file system.
.It Va WITHOUT_ZONEINFO
.\" $FreeBSD$
=======
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ZFS 168409 2007-04-06 02:13:30Z pjd
Set to not build ZFS file system.
.It Va WITHOUT_ZONEINFO
.\" from FreeBSD: stable/11/tools/build/options/WITHOUT_ZONEINFO 235342 2012-05-12 16:12:36Z gjb
>>>>>>> origin/freebsd/11-stable/master
Set to not build the timezone database.
.El
.Sh FILES
.Bl -tag -compact -width Pa
.It Pa /etc/src.conf
.It Pa /etc/src-env.conf
.It Pa /usr/share/mk/bsd.own.mk
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr make.conf 5 ,
.Xr build 7 ,
.Xr ports 7
.Sh HISTORY
The
.Nm
file appeared in
.Fx 7.0 .
.Sh AUTHORS
This manual page was autogenerated.
